sngeometry_manager.org
#+TITLE:  SNGeometry Manager Configuration
#+AUTHOR: Xavier Garrido
#+DATE:   2013-03-12
#+OPTIONS: ^:{}

* Introduction
The =sngeometry= library provides some geometry wrappers arround =geomtools=
library and dedicated to SuperNEMO detector description.

This file holds mainly the paths to geometry files most of them are placed in
=$SNGEOMETRY_DATA_DIR= directory.

* Manager configuration
:PROPERTIES:
:TANGLE: sngeometry_manager.conf
:END:

** Setup label, description and version
#+BEGIN_SRC sh
  #@description Setup label
  setup_label : string = "snemo"

  #@description Setup description
  setup_description : string = "SuperNEMO demonstrator module"

  #@description Setup version
  setup_version : string = "3.0"
#+END_SRC

** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

** Geometry factory
The geometry factory holds all the files needed for the geometry construction.

*** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority of the embedded geometry model factory
  factory.logging.priority : string = "warning"
#+END_SRC

*** Geometry files
#+BEGIN_SRC sh
  #@description List of files describing the geometry models
  factory.geom_files : string[22] as path =                                                                       \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_calibration.geom"            \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_frame_horizontal_beams.geom" \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_frame_vertical_beams.geom"   \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_strips.geom"                 \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_foil_support.geom"           \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_module.geom"                 \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/pmt_5inch.geom"                   \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/xwall_module.geom"                \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/xwall.geom"                       \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/gveto_module.geom"                \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/gveto.geom"                       \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_drift_cell_base.geom"     \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_drift_cell_nodes.geom"    \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_layers.geom"              \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_volumes.geom"             \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_submodules.geom"          \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/pmt_8inch.geom"               \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_module.geom"      \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_walls.geom"       \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_submodules.geom"  \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/module_0.geom"                                    \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/setup.geom"
#+END_SRC

** ID manager
*** Logging priority
#+BEGIN_SRC sh
  #@description Logging flag of the embedded ID manager
  id_mgr.logging.priority : string = "warning"
#+END_SRC

*** Category list
Categories are used to assign a unique id number (integer) to a geometrical
volume.
#+BEGIN_SRC sh
  #@description Source file of the geometry categories used by the ID manager
  id_mgr.categories_list : string as path = \
      "${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/categories.lis"
#+END_SRC

