doc/html/sngeometry_manager.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>SNGeometry Manager Configuration</title>
<!-- 2013-10-20 dim. 00:54 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Xavier Garrido" />
<link rel="stylesheet" href="css/styles.css">
                 <link rel="stylesheet" href="css/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
<a href="simulation_config.html">main</a>
                     <a href="sngeometry_manager.html">geometry manager</a>
                     <a href="sng4_manager.html">G4 manager</a>
                     <a href="step_hit_processor_factory.html">step hit processor</a>
                     <a href="sngenbb_manager.html">genbb manager</a>
                     <a href="snanalysis_manager.html">analysis</a>
</div>
<div id="content">
<h1 class="title">SNGeometry Manager Configuration</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Manager configuration</a>
<ul>
<li><a href="#sec-2-1">2.1. Setup label, description and version</a></li>
<li><a href="#sec-2-2">2.2. Logging priority</a></li>
<li><a href="#sec-2-3">2.3. Geometry factory</a></li>
<li><a href="#sec-2-4">2.4. ID manager</a></li>
<li><a href="#sec-2-5">2.5. Mapping configuration</a></li>
<li><a href="#sec-2-6">2.6. Plugins configuration</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Material for SuperNEMO detector</a>
<ul>
<li><a href="#sec-3-1">3.1. Material driver</a></li>
<li><a href="#sec-3-2">3.2. Material aliases</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Magnetic field for SuperNEMO detector</a>
<ul>
<li><a href="#sec-4-1">4.1. Magnetic field plugin</a></li>
<li><a href="#sec-4-2">4.2. Magnetic field drivers</a></li>
</ul>
</li>
<li><a href="#sec-5">5. Locators for SuperNEMO detector</a>
<ul>
<li><a href="#sec-5-1">5.1. Locator driver</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
The <code>sngeometry</code> library provides some geometry wrappers arround <code>geomtools</code>
library and dedicated to SuperNEMO detector description.
</p>

<p>
This file holds mainly the paths to geometry files most of them are placed in
<code>$SNGEOMETRY_DATA_DIR</code> directory.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Manager configuration</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Setup label, description and version</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup label</span>
setup_label : <span class="org-variable-name">string</span> = <span class="org-string">"snemo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup description</span>
setup_description : <span class="org-variable-name">string</span> = <span class="org-string">"SuperNEMO demonstrator module"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Setup version</span>
setup_version : <span class="org-variable-name">string</span> = <span class="org-string">"3.0"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Logging priority</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Geometry factory</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The geometry factory holds all the files needed for the geometry construction.
</p>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1">Logging priority</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority of the embedded geometry model factory</span>
factory.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3-2" class="outline-4">
<h4 id="sec-2-3-2">Geometry files</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files describing the geometry models</span>
factory.geom_files : string[22] as <span class="org-variable-name">path</span> =                                                                       <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_calibration.geom"</span>            <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_frame_horizontal_beams.geom"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_frame_vertical_beams.geom"</span>   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_strips.geom"</span>                 <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_foil_support.geom"</span>           <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/source_module/source_module.geom"</span>                 <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/pmt_5inch.geom"</span>                   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/xwall_module.geom"</span>                <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/xwall.geom"</span>                       <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/gveto_module.geom"</span>                <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/gveto.geom"</span>                       <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_drift_cell_base.geom"</span>     <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_drift_cell_nodes.geom"</span>    <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_layers.geom"</span>              <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_volumes.geom"</span>             <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/tracker_modules/tracker_submodules.geom"</span>          <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/pmt_8inch.geom"</span>               <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_module.geom"</span>      <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_walls.geom"</span>       <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/calorimeter_modules/calorimeter_submodules.geom"</span>  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/module_0.geom"</span>                                    <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/setup.geom"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> ID manager</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1">Logging priority</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging flag of the embedded ID manager</span>
id_mgr.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2">Category list</h4>
<div class="outline-text-4" id="text-2-4-2">
<p>
Categories are used to assign a unique id number (integer) to a geometrical
volume.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Source file of the geometry categories used by the ID manager</span>
id_mgr.categories_list : string as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/setups/snemo/config_3.0/categories.lis"</span>
</pre>
</div>
</div>
</div>
</div>
