sngeometry_manager.org
** Mapping configuration
#+BEGIN_SRC sh
  #@description Build the embedded mapping dictionnary
  build_mapping : boolean = 0

  #@description Max depth of the mapping: no items to be mapped
  mapping.max_depth : integer = 0

  #@description Categories not to be registered in the mapping dictionnary
  mapping.excluded_categories : string[5] = \
      "drift_cell_field_wires_set" \
      "drift_cell_field_wire"      \
      "drift_cell_base"            \
      "drift_cell_cathodic_ring"   \
      "drift_cell_anodic_wire"
#+END_SRC

** Plugins configuration
#+BEGIN_SRC sh
  #@description Plugins factory preload from system registration (default=0)
  plugins.factory_no_preload : boolean = 0

  #@description Plugins initialization at load (default=0)
  plugins.force_initialization_at_load : boolean = 0

  #@description Configuration files for geometry manager's plugins
  plugins.configuration_files : string[3] as path =                                        \
      "${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/materials_plugin.conf"      \
      "${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/magnetic_field_plugin.conf" \
      "${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/locator_plugin.conf"
#+END_SRC

* Material for SuperNEMO detector
** Material driver
:PROPERTIES:
:TANGLE:    materials_plugin.conf
:END:

We use the definitions of isotopes, elements and materials from the installed
materials library. Here the =materials_aliases= definition are locally defined
to change the source foil isotope.
*** Plugin declaration
#+BEGIN_SRC sh
  #@description The geometry manager plugin for materials

  #@key_label  "name"
  #@meta_label "type"

  [name="materials_driver" type="geomtools::materials_plugin"]
#+END_SRC

*** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

*** Files
#+BEGIN_SRC sh
  #@description List of files describing the materials
  materials.files : string[6] as path =                          \
      "@materials:data/std_isotopes.def"    \
      "@materials:data/std_elements.def"    \
      "@materials:data/std_materials.def"   \
      "${SNGEOMETRY_DATA_DIR}/resources/materials/elements.def"  \
      "${SNGEOMETRY_DATA_DIR}/resources/materials/materials.def" \
      "${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/materials_aliases.def"
#+END_SRC

