doc/html/sngeometry_manager.html
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> Mapping configuration</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Build the embedded mapping dictionnary</span>
build_mapping : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Max depth of the mapping: no items to be mapped</span>
mapping.max_depth : <span class="org-variable-name">integer</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Categories not to be registered in the mapping dictionnary</span>
mapping.excluded_categories : string [5] = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_field_wires_set"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_field_wire"</span>      <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_base"</span>            <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_cathodic_ring"</span>   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"drift_cell_anodic_wire"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> Plugins configuration</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Plugins factory preload from system registration (default=0)</span>
plugins.factory_no_preload : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Plugins initialization at load (default=0)</span>
plugins.force_initialization_at_load : <span class="org-variable-name">boolean</span> = 0

<span class="org-comment-delimiter">#</span><span class="org-comment">@description Configuration files for geometry manager's plugins</span>
plugins.configuration_files : string[3] as <span class="org-variable-name">path</span> =                                        <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/materials_plugin.conf"</span>      <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/magnetic_field_plugin.conf"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/locator_plugin.conf"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Material for SuperNEMO detector</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Material driver</h3>
<div class="outline-text-3" id="text-3-1">
<p>
We use the definitions of isotopes, elements and materials from the installed
materials library. Here the <code>materials_aliases</code> definition are locally defined
to change the source foil isotope.
</p>
</div>
<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1">Plugin declaration</h4>
<div class="outline-text-4" id="text-3-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The geometry manager plugin for materials</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label  "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"materials_driver"</span> <span class="org-variable-name">type</span>=<span class="org-string">"geomtools::materials_plugin"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2">Logging priority</h4>
<div class="outline-text-4" id="text-3-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3">Files</h4>
<div class="outline-text-4" id="text-3-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description List of files describing the materials</span>
materials.files : string[6] as <span class="org-variable-name">path</span> =                          <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${MATERIALS_DATA_DIR}/resources/data/std_isotopes.def"</span>    <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${MATERIALS_DATA_DIR}/resources/data/std_elements.def"</span>    <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${MATERIALS_DATA_DIR}/resources/data/std_materials.def"</span>   <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/materials/elements.def"</span>  <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNGEOMETRY_DATA_DIR}/resources/materials/materials.def"</span> <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/materials_aliases.def"</span>
</pre>
</div>
</div>
</div>
</div>
