sngeometry_manager.org
** Material aliases
:PROPERTIES:
:TANGLE: materials_aliases.def
:END:

#+BEGIN_SRC sh
  #@description A sample list of elements
  #@key_label   "name"
  #@meta_label  "type"

  [name="vacuum" type="alias"]
  #@description The alias for vacuum
  material : string = "std::vacuum"

  [name="glass" type="alias"]
  #@description The alias for glass
  material : string = "std::pyrex"

  [name="tracking_gas" type="alias"]
  #@description The alias for tracking gas
  material : string = "snemo::nemo3_tracking_gas"

  [name="copper" type="alias"]
  #@description The alias for metal
  material : string = "std::copper"

  [name="iron" type="alias"]
  #@description The alias for metal
  material : string = "std::iron"

  [name="ENVINET_PS_scintillator" type="alias"]
  #@description The alias for X-walls plastic scintillator
  material : string = "std::NE110"

  [name="Dubna_PS_scintillator" type="alias"]
  #@description The alias for gamma veto plastic scintillator
  material : string = "std::NE110"

  [name="PVT_scintillator" type="alias"]
  #@description The alias for PVT plastic scintillator
  material : string = "std::PVT"

  [name="scin_wrapper" type="alias"]
  #@description The alias for plastic scintillator wrapping material
  material : string = "std::mylar"

  [name="frame_metal" type="alias"]
  #@description The alias for the frames material
  material : string = "std::iron"

  [name="wire_metal" type="alias"]
  #@description The alias for the wire material
  material : string = "std::inox"

  [name="lab_air" type="alias"]
  #@description The alias for the air gas in the lab
  material : string = "snemo::lab_air"

  [name="nitrogen" type="alias"]
  #@description The alias for the nitrogen gas
  material : string = "snemo::nitrogen"

  [name="bb_source_material" type="alias"]
  #@description The alias for the source
  material : string = "snemo::se82_source_material"

  [name="RTV" type="alias"]
  #@description The alias for the RTV material
  material : string = "std::water"

  [name="SBR" type="alias"]
  #@description The alias for the SBR material
  material : string = "std::water"

  [name="PFTE" type="alias"]
  #@description The alias for the PFTE material
  material : string = "std::mylar"
#+END_SRC

* Magnetic field for SuperNEMO detector
** Magnetic field plugin
:PROPERTIES:
:TANGLE: magnetic_field_plugin.conf
:END:

*** Plugin declaration
#+BEGIN_SRC sh
  #@description The geometry manager plugin for emfield

  #@key_label  "name"
  #@meta_label "type"

  [name="fields_driver" type="emfield::emfield_geom_plugin"]
#+END_SRC

*** Logging priority
#+BEGIN_SRC sh
  #@description Logging priority
  logging.priority : string = "warning"
#+END_SRC

*** EM field manager configuration
#+BEGIN_SRC sh
  #@description Manager logging priority
  manager.logging.priority : string = "warning"

  #@description The name of the geometry service
  manager.services.geometry : string = "Geo"

  #@description List of EM fields definitions files
  manager.field_definitions_filenames : string[1] as path = \
      "${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/magnetic_field_drivers.conf"
#+END_SRC

EM field defined within =manager.field_definitions_filenames= file can be set
independently and at the same time for different G4 volumes. This association
between volumes and field is done by the =geom_map= object of =emfield=
component. For SuperNEMO, constant magnetic field is defined inside demonstrator
module.
#+BEGIN_SRC sh
  #@description Flag to activate the geometry volume/field associations map
  manager.build_geom_map : boolean = 1

  #@description Manager logging priority
  manager.geom_map.logging.priority : string = "warning"

  #@description The list of EM fields associated to some logical volumes
  manager.geom_map.associations.labels : string[1] = "sn_module"

  #@description The logical model associated for the label 'tracker'
  manager.geom_map.associations.sn_module.volume : string = "module_basic.model.log"

  #@description The EM field associated for the label "tracker"
  manager.geom_map.associations.sn_module.field_name : string = "B_module"
#+END_SRC

** Magnetic field drivers
:PROPERTIES:
:TANGLE: magnetic_field_drivers.conf
:END:

