doc/html/sngeometry_manager.html
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Material aliases</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description A sample list of elements</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label   "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label  "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"vacuum"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for vacuum</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::vacuum"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"glass"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for glass</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::pyrex"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"tracking_gas"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for tracking gas</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::nemo3_tracking_gas"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"copper"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for metal</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::copper"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"iron"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for metal</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::iron"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"ENVINET_PS_scintillator"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for X-walls plastic scintillator</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::NE110"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"Dubna_PS_scintillator"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for gamma veto plastic scintillator</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::NE110"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"PVT_scintillator"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for PVT plastic scintillator</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::PVT"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"scin_wrapper"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for plastic scintillator wrapping material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::mylar"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"frame_metal"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the frames material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::iron"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"wire_metal"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the wire material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::inox"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"lab_air"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the air gas in the lab</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::lab_air"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"nitrogen"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the nitrogen gas</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::nitrogen"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"bb_source_material"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the source</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"snemo::se82_source_material"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"RTV"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the RTV material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::water"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"SBR"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the SBR material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::water"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"PFTE"</span> <span class="org-variable-name">type</span>=<span class="org-string">"alias"</span>]
<span class="org-comment-delimiter">#</span><span class="org-comment">@description The alias for the PFTE material</span>
material : <span class="org-variable-name">string</span> = <span class="org-string">"std::mylar"</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Magnetic field for SuperNEMO detector</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Magnetic field plugin</h3>
<div class="outline-text-3" id="text-4-1">
</div>

<div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1">Plugin declaration</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description The geometry manager plugin for emfield</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@key_label  "name"</span>
<span class="org-comment-delimiter">#</span><span class="org-comment">@meta_label "type"</span>

[<span class="org-variable-name">name</span>=<span class="org-string">"fields_driver"</span> <span class="org-variable-name">type</span>=<span class="org-string">"emfield::emfield_geom_plugin"</span>]
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2">Logging priority</h4>
<div class="outline-text-4" id="text-4-1-2">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Logging priority</span>
logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-3" class="outline-4">
<h4 id="sec-4-1-3">EM field manager configuration</h4>
<div class="outline-text-4" id="text-4-1-3">
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Manager logging priority</span>
manager.logging.priority : <span class="org-variable-name">string</span> = <span class="org-string">"warning"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The name of the geometry service</span>
manager.services.geometry : <span class="org-variable-name">string</span> = <span class="org-string">"Geo"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description List of EM fields definitions files</span>
manager.field_definitions_filenames : string[1] as <span class="org-variable-name">path</span> = <span class="org-sh-escaped-newline">\</span>
    <span class="org-string">"${SNAILWARE_SIMULATION_DIR}/snemo_configuration/current/magnetic_field_drivers.conf"</span>
</pre>
</div>

<p>
EM field defined within <code>manager.field_definitions_filenames</code> file can be set
independently and at the same time for different G4 volumes. This association
between volumes and field is done by the <code>geom_map</code> object of <code>emfield</code>
component. For SuperNEMO, constant magnetic field is defined inside demonstrator
module.
</p>
<div class="org-src-container">

<pre class="src src-sh"><span class="org-comment-delimiter">#</span><span class="org-comment">@description Flag to activate the geometry volume/field associations map</span>
manager.build_geom_map                           : <span class="org-variable-name">boolean</span> = 1

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The list of EM fields associated to some logical volumes</span>
manager.geom_map.associations.labels             : <span class="org-variable-name">string</span>[1] = <span class="org-string">"sn_module"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The logical model associated for the label 'tracker'</span>
manager.geom_map.associations.sn_module.volume     : <span class="org-variable-name">string</span> = <span class="org-string">"module_basic.model.log"</span>

<span class="org-comment-delimiter">#</span><span class="org-comment">@description The EM field associated for the label "tracker"</span>
manager.geom_map.associations.sn_module.field_name : <span class="org-variable-name">string</span> = <span class="org-string">"B_module"</span>
</pre>
</div>
</div>
</div>
</div>
